### Q1. List any five functions of the pandas library with execution.

- head() : It returns the first few row of the dataframe.
- tail() :Returns last few rows of the dataframe.
- iloc[ ] : Used for integer based indexing.
- loc[ ] : Used for label based indexing.
- filter() : Used for filtering data based on specific condition.

In [1]:
import pandas as pd
df = pd.DataFrame({
    'Name' : ['Alice','Bob','Claire','John','Aryton','Emma'],
    'Age' : [25,30,27,34,25,28],
    'Gender' : ['Female','Male','Female','Male','Male','Female']
})

#returns first 3 rows
df.head(3)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [2]:
#returns last 3 rows
df.tail(3)

     Name  Age  Gender
3    John   34    Male
4  Aryton   25    Male
5    Emma   28  Female

In [3]:
#integer based indexing
df.iloc[0:3,0:3:2]

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female

In [4]:
#label based indexing
df.loc[0:3,['Name','Gender']]

     Name  Gender
0   Alice  Female
1     Bob    Male
2  Claire  Female
3    John    Male

In [5]:
#returns only female 
df[df['Gender']=='Female']

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
5    Emma   28  Female

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [6]:
#creating a dataframe
df2 = pd.DataFrame([('Ashu',22,'Male'),('Shanu',21,'Female'),('Daksh',20,'Male')], columns = ['A','B','C'])
df2

       A   B       C
0   Ashu  22    Male
1  Shanu  21  Female
2  Daksh  20    Male

In [7]:
#dataframe reindexing
df2.index = pd.Series(range(1,(len(df2)*2+1),2))
df2

       A   B       C
1   Ashu  22    Male
3  Shanu  21  Female
5  Daksh  20    Male

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [8]:
#dataframe
df3 = pd.DataFrame({'values':[10,20,30,40,50,60]})

#function iterating over dataframe and calculating sum of first 3 elements
def sum3(x):
    s = 0
    for i in x.index[0:3]:
        s += x.iloc[i]
    print('the sum is',s)
    return s

df3.apply(sum3)

the sum is 60

values    60
dtype: int64

In [9]:
#simpler way of doing it
import numpy as np
df3['values'][0:3].aggregate(np.sum)

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [10]:
#creating a dataframe with text column
dftext = pd.DataFrame({'Text' : ['The Full Stack Data Science course by PWSkills offers a comprehensive curriculum that equips learners with the skills and knowledge to excel in the rapidly evolving field of data science. Through hands-on projects and industry-relevant case studies, students will gain proficiency in every stage of the data science lifecycle. Join us to become a well-rounded data science professional capable of tackling real-world challenges.',
                                 'Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets.',
                                'Master Full Stack Web Development with our MERN stack course. Learn MongoDB, Express.js, React.js, and Node.js to create dynamic web applications. Gain hands-on experience and build a strong foundation in full-stack development.']})

#setting the max character width to 1000
pd.set_option('display.max_colwidth',1000)
dftext

                                                                                                                                                                                                                                                                                                                                                                                                                                           Text
0  The Full Stack Data Science course by PWSkills offers a comprehensive curriculum that equips learners with the skills and knowledge to excel in the rapidly evolving field of data science. Through hands-on projects and industry-relevant case studies, students will gain proficiency in every stage of the data science lifecycle. Join us to become a well-rounded data science professional capable of tackling real-world challenges.
1                                Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets.
2                                                                                                                                                                                                          Master Full Stack Web Development with our MERN stack course. Learn MongoDB, Express.js, React.js, and Node.js to create dynamic web applications. Gain hands-on experience and build a strong foundation in full-stack development.

In [11]:
#adding another column for word count
#spliting all the words in a list and counting its len
dftext['Word_Count'] = dftext['Text'].apply(lambda x : len(x.split()))
dftext

,Text,Word_Count
0,"The Full Stack Data Science course by PWSkills offers a comprehensive curriculum that equips learners with the skills and knowledge to excel in the rapidly evolving field of data science. Through hands-on projects and industry-relevant case studies, students will gain proficiency in every stage of the data science lifecycle. Join us to become a well-rounded data science professional capable of tackling real-world challenges.",63
1,"Data Science Masters course is highly curated and uniquely designed according to the latest industry standards. This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets.",52
2,"Master Full Stack Web Development with our MERN stack course. Learn MongoDB, Express.js, React.js, and Node.js to create dynamic web applications. Gain hands-on experience and build a strong foundation in full-stack development.",32

### Q5. How are DataFrame.size and DataFrame.shape() different?

Ans. Dataframe.size returns the number of elements. It returns number of rows for a series and rows*columns for a dataframe.

Whereas Dataframe.shape is used for knowing the dimensionality of the dataframe (number of rows, number of columns)

In [12]:
#returns number of elements in the dataframe
dftext.size

6

In [13]:
#returns dimensionality of the dataframe
dftext.shape

(3, 2)

### Q6. Which function of pandas do we use to read an excel file?

Ans We use pd.read_excel() to read an excel file.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [14]:
#dataframe for emails
dfemail = pd.DataFrame({'Email':['ashu@gmail.com','shanu@gmail.com','daksh@gmail.com','suraj.singh@gmail.com']})
dfemail

                   Email
0         ashu@gmail.com
1        shanu@gmail.com
2        daksh@gmail.com
3  suraj.singh@gmail.com

In [15]:
#creating username column which stores the username from the email
#lambda function splits the email with sep'@' and take the first element from the splitted list
dfemail['Username']=dfemail['Email'].apply(lambda x: x.split(sep='@')[0])
dfemail

                   Email     Username
0         ashu@gmail.com         ashu
1        shanu@gmail.com        shanu
2        daksh@gmail.com        daksh
3  suraj.singh@gmail.com  suraj.singh

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. 

For example, if df contains the following values:

A B C

0 3 5 1

1 8 2 7

2 6 9 4

3 2 3 5

4 9 1 2

Your function should select the following rows: 

A B C

1 8 2 7

4 9 1 2

The function should return a new DataFrame that contains only the selected rows.

In [16]:
#dataframe
df4 = pd.DataFrame({'A':[2,3,4,6,8,10],
                   'B':[6,7,8,9,7,12],
                   'C':[2,3,4,5,6,7]})

def filter_df(df):
    return df[(df['A']>5) & (df['B']<10)]
        

filter_df(df4)

   A  B  C
3  6  9  5
4  8  7  6

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [17]:
#function to calculate mean, median and mode

def stats(df):
    df_mean = df.mean()
    df_med = df.median()
    df_std = df.std()
    return ("The mean is {}, median is {} and standard deviation is {}".format(df_mean, df_med, df_std))

df3.apply(stats)

values    The mean is 35.0, median is 35.0 and standard deviation is 18.708286933869708
dtype: object

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [18]:
#dataframe
date = pd.date_range(start= '2023-07-31', end = '2023-08-15')
df = pd.DataFrame({'Sales': [100,101,200,245,456,234,341,234,456,124,454,785,564,347,123,432],
                  'Date':date})
df.head()

   Sales       Date
0    100 2023-07-31
1    101 2023-08-01
2    200 2023-08-02
3    245 2023-08-03
4    456 2023-08-04

In [19]:
#calculating moving average
def mvg_avg(x):
    x['MovingAverage'] = x['Sales'].rolling(window=7).mean()
    return x

mvg_avg(df)

    Sales       Date  MovingAverage
0     100 2023-07-31            NaN
1     101 2023-08-01            NaN
2     200 2023-08-02            NaN
3     245 2023-08-03            NaN
4     456 2023-08-04            NaN
5     234 2023-08-05            NaN
6     341 2023-08-06     239.571429
7     234 2023-08-07     258.714286
8     456 2023-08-08     309.428571
9     124 2023-08-09     298.571429
10    454 2023-08-10     328.428571
11    785 2023-08-11     375.428571
12    564 2023-08-12     422.571429
13    347 2023-08-13     423.428571
14    123 2023-08-14     407.571429
15    432 2023-08-15     404.142857

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

Date

0 2023-01-01

1 2023-01-02

2 2023-01-03

3 2023-01-04

4 2023-01-05

In [20]:
#dataframe
date = pd.date_range(start = '2023-07-31', end = '2023-08-15')
df5 = pd.DataFrame({'Date': date})
df5.head()

        Date
0 2023-07-31
1 2023-08-01
2 2023-08-02
3 2023-08-03
4 2023-08-04

In [21]:
#fundtion to create a new column name weekday
def dayname(x):
    x['Weekday'] = x['Date'].dt.day_name()
    return x

dayname(df5)

         Date    Weekday
0  2023-07-31     Monday
1  2023-08-01    Tuesday
2  2023-08-02  Wednesday
3  2023-08-03   Thursday
4  2023-08-04     Friday
5  2023-08-05   Saturday
6  2023-08-06     Sunday
7  2023-08-07     Monday
8  2023-08-08    Tuesday
9  2023-08-09  Wednesday
10 2023-08-10   Thursday
11 2023-08-11     Friday
12 2023-08-12   Saturday
13 2023-08-13     Sunday
14 2023-08-14     Monday
15 2023-08-15    Tuesday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [22]:
#dataframe
date = pd.date_range(start='2022-12-01', end = '2023-02-28')
df6 = pd.DataFrame({'Date':date})
df6.head()

        Date
0 2022-12-01
1 2022-12-02
2 2022-12-03
3 2022-12-04
4 2022-12-05

In [23]:
def date_window(x):
    df = x[(x['Date']>='2023-01-01') & (x['Date']<='2023-01-31')]
    return df
date_window(df6).head()

         Date
31 2023-01-01
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05

In [24]:
date_window(df6).tail()

         Date
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30
61 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Ans. We need to import pandas to use any pandas functions.